
```python
name = pd.DataFrame({'업소명' : ['버거킹 군자능동점', '빠오즈푸 본점', '숙성부심', '영미오리탕', '싸다김밥 어린이대공원역점', '산들', '은혜즉석떡볶이', '능동아구찜', '보승회관 군자역점',
                            '미식반점 군자본점', '미식일가', '스위트앤카츠', '스시노칸도 어린이대공원역점', '천미향', '하이난', '샐러디 군자역점', '기와집 능이백숙삼계탕 본점',
                            '한촌설렁탕 군자점', '카레당', '하오츠', '새벽집군자점', '능동국시', '군자김밥 군자본점', '또래끼리', '세종원 군자본점', '화양리정육식당',
                            '고봉민김밥인 서울군자점', '돈카와치 어린이대공원점', '얌샘김밥 세종대점', '스시교센', '채선당 월남쌈 & 샤브샤브 화양점', '혼다라멘 어린이대공원점',
                            '장어시대 군자점', '만게츠', '알고', '라운지앤', '용두동할매쭈꾸미', '장수마을 정육식당', '무한정수제돈까스 군자점', '피자스쿨 세종대점', '미주류 본점',
                            '담꾹 군자점', '본죽 군자역점', '심야식당쿠난', '요마시', '이삭토스트 세종대점', '뉴욕떡볶이', '섬진강민물장어', '봉추찜닭 군자역점', '60계치킨 군자점',
                            '광나루유황오리주물럭']})

num = pd.DataFrame({'고유번호' : [1511881360, 20757891, 1178891712, 11687205, 1981065688,
                              31234534, 20912981, 13199247, 1827382271, 1472793185,
                              36215038, 36481365, 1156658135, 12035278, 11611452,
                              1733116910, 34320746, 1900231521, 1254145458, 37101744,
                              38010611, 38275086, 1155648623, 37213189, 34628680,
                              1947162354, 35044920, 1542379601, 1234257499, 1875865667,
                              21693162, 1085950217, 1548611684, 1503215430, 810682299,
                              32822240, 12901119, 21597707, 32848507, 20943449,
                              1331438803, 1849204025, 13337899, 1847664192, 1867205146,
                              20893928, 37358975, 1189624815, 11598457, 1429755390,
                              20931930]})
```
