# 피어슨 상관계수 이용하여 선택한 식당과 유사한 식당 10개를 추천

import pandas as pd
import numpy as np
csv_file = pd.read_csv(r'C:\Users\shihy\smarthon\redata.csv')


new_data = csv_file
new_data = new_data.fillna(0)


for i in range(0, 51):
    for j in range(1, 20):
        new_data.iloc[i, j] = new_data.iloc[i, j] / new_data.iloc[i, 20] * 100


# 평균
se = []
for j in range(1, 20):
    data = 0
    for i in range(0, 51):
        data += new_data.iloc[i, j]
    data = data / 51
    se.append(data)

se_df = pd.DataFrame(se, index=['맛있다', '빠르다', '웨이팅', '비싸다', '청결', '더럽다', '쾌적', '분위기', '넓다', '좁다', '친절하다', '불친절하다', '좋다', '강추', '별로', '신선하다', '다양하다', '편리하다', '유명하다'])
se_df = se_df.T



s1_c = new_data
for i in range(0, 51):
    for j in range(1, 20):
        s1_c.iloc[i, j] = new_data.iloc[i, j] - se_df.iloc[0, j-1]
        if s1_c.iloc[i, j] <= 0:
            s1_c.iloc[i, j] = 0


# 식당 이름 name으로 받아옴
name1 = '버거킹 군자능동점'
name2 = '빠오즈푸 본점'
name3 = '숙성부심'


for i in range(len(new_data)):
    if name1 == s1_c['음식점'][i]:
        s2_c_1 = s1_c.loc[[i]]

    elif name2 == s1_c['음식점'][i]:
        s2_c_2 = s1_c.loc[[i]]

    elif name3 == s1_c['음식점'][i]:
        s2_c_3 = s1_c.loc[[i]]


pear1 = []
pear2 = []
pear3 = []

for i in range(51):
    cal1 = 0
    cal2 = 0
    cal3 = 0

    for j in range(1, 20):
        cal1 += s1_c.iloc[i, j] * s2_c_1.iloc[0, j]
        cal2 += s1_c.iloc[i, j] * s2_c_2.iloc[0, j]
        cal3 += s1_c.iloc[i, j] * s2_c_3.iloc[0, j]

    pear1.append(cal1)
    pear2.append(cal2)
    pear3.append(cal3)

pear1_df = pd.DataFrame(pear1, index = ['버거킹 군자능동점', '빠오즈푸 본점', '숙성부심', '영미오리탕', '싸다김밥 어린이대공원역점', '산들', '은혜즉석떡볶이', '능동아구찜', '보승회관 군자역점',
                            '미식반점 군자본점', '미식일가', '스위트앤카츠', '스시노칸도 어린이대공원역점', '천미향', '하이난', '샐러디 군자역점', '기와집 능이백숙삼계탕 본점',
                            '한촌설렁탕 군자점', '카레당', '하오츠', '새벽집군자점', '능동국시', '군자김밥 군자본점', '또래끼리', '세종원 군자본점', '화양리정육식당',
                            '고봉민김밥인 서울군자점', '돈카와치 어린이대공원점', '얌샘김밥 세종대점', '스시교센', '채선당 월남쌈 & 샤브샤브 화양점', '혼다라멘 어린이대공원점',
                            '장어시대 군자점', '만게츠', '알고', '라운지앤', '용두동할매쭈꾸미', '장수마을 정육식당', '무한정수제돈까스 군자점', '피자스쿨 세종대점', '미주류 본점',
                            '담꾹 군자점', '본죽 군자역점', '심야식당쿠난', '요마시', '이삭토스트 세종대점', '뉴욕떡볶이', '섬진강민물장어', '봉추찜닭 군자역점', '60계치킨 군자점',
                            '광나루유황오리주물럭'])

pear2_df = pd.DataFrame(pear2, index = ['버거킹 군자능동점', '빠오즈푸 본점', '숙성부심', '영미오리탕', '싸다김밥 어린이대공원역점', '산들', '은혜즉석떡볶이', '능동아구찜', '보승회관 군자역점',
                            '미식반점 군자본점', '미식일가', '스위트앤카츠', '스시노칸도 어린이대공원역점', '천미향', '하이난', '샐러디 군자역점', '기와집 능이백숙삼계탕 본점',
                            '한촌설렁탕 군자점', '카레당', '하오츠', '새벽집군자점', '능동국시', '군자김밥 군자본점', '또래끼리', '세종원 군자본점', '화양리정육식당',
                            '고봉민김밥인 서울군자점', '돈카와치 어린이대공원점', '얌샘김밥 세종대점', '스시교센', '채선당 월남쌈 & 샤브샤브 화양점', '혼다라멘 어린이대공원점',
                            '장어시대 군자점', '만게츠', '알고', '라운지앤', '용두동할매쭈꾸미', '장수마을 정육식당', '무한정수제돈까스 군자점', '피자스쿨 세종대점', '미주류 본점',
                            '담꾹 군자점', '본죽 군자역점', '심야식당쿠난', '요마시', '이삭토스트 세종대점', '뉴욕떡볶이', '섬진강민물장어', '봉추찜닭 군자역점', '60계치킨 군자점',
                            '광나루유황오리주물럭'])


pear3_df = pd.DataFrame(pear3, index = ['버거킹 군자능동점', '빠오즈푸 본점', '숙성부심', '영미오리탕', '싸다김밥 어린이대공원역점', '산들', '은혜즉석떡볶이', '능동아구찜', '보승회관 군자역점',
                            '미식반점 군자본점', '미식일가', '스위트앤카츠', '스시노칸도 어린이대공원역점', '천미향', '하이난', '샐러디 군자역점', '기와집 능이백숙삼계탕 본점',
                            '한촌설렁탕 군자점', '카레당', '하오츠', '새벽집군자점', '능동국시', '군자김밥 군자본점', '또래끼리', '세종원 군자본점', '화양리정육식당',
                            '고봉민김밥인 서울군자점', '돈카와치 어린이대공원점', '얌샘김밥 세종대점', '스시교센', '채선당 월남쌈 & 샤브샤브 화양점', '혼다라멘 어린이대공원점',
                            '장어시대 군자점', '만게츠', '알고', '라운지앤', '용두동할매쭈꾸미', '장수마을 정육식당', '무한정수제돈까스 군자점', '피자스쿨 세종대점', '미주류 본점',
                            '담꾹 군자점', '본죽 군자역점', '심야식당쿠난', '요마시', '이삭토스트 세종대점', '뉴욕떡볶이', '섬진강민물장어', '봉추찜닭 군자역점', '60계치킨 군자점',
                            '광나루유황오리주물럭'])


tot = pear1_df + pear2_df + pear3_df


tot = tot.sort_values([0], ascending=False)

print(tot)
